# CannotCopyGridLinesWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyGridLinesWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyGridLinesWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyGridLinesWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyGridLinesWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace